'''Составить программу вывода на экран числа, вводимого с клавиатуры. Выводимому числу должно предшествовать сообщение "Вы ввели число".'''
a=int(input())
print ('Вы ввели число', a)