'''Напишите процедуру, которая принимает параметр – натуральное число N – и выводит на экран линию из N символов '–'.'''
s=int(input())
print('-'*int(s))